// ============================================================================
// Description: 守望者的逃离
// URL: https://www.luogu.org/problemnew/show/P1095
// Author: Sofee < _s@mail.nwpu.edu.cn >
// ============================================================================
#include <iostream>

using namespace std;

int main() {
    int m, s, t;
    cin >> m >> s >> t;
    
    int s1 = 0, s2 = 0, i;
    bool solved = false;
    for (i = 1; i <= t; ++i) {
        if (m < 10) {
            m += 4;
        } else {
            m -= 10;
            s1 += 60;
        }

        s2 += 17;

        if (s2 < s1) s2 = s1;

        if (s1 >= s || s2 >= s) {
            solved = true;
            break;
        }
    }

    if (solved) {
        cout << "Yes\n" << i << endl;
    } else {
        cout << "No\n" << max(s1, s2) << endl;
    }
    return 0;
}
// ============================================================================
// Keys: 简单计算可以得到闪烁的效率是比走路快的，所以应当在能闪烁时就闪烁
// 对于边界条件，可以让两个人同时跑，一个人只闪烁一个人只跑步
// 每当闪烁的距离大于跑步的距离时，将跑步的人移动到闪烁的人的位置
// 应当对每秒两个人的位置进行判断，如果跑出，则停止计算，输出yes和当前时间
// 若循环正常结束则说明两人都没有跑出，此时输出no和两者之间移动距离较大值
// ============================================================================
